Repository: Samk13/invenio-administration
Catalog: invenio_administration/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: Administration
fi: Ylläpito

source: Invalid resource {resource} configured for view {view}.
fi: Virheellinen resurssi {resource} määritetty näkymälle {view}.

source: No extension found with name '{extension_name}' .
fi: Laajennusta nimellä '{extension_name}' ei löytynyt.

source: Invalid actions configuration, order or schema missing
fi: Virheellinen toimintojen määritys, järjestys tai skeema puuttuu

source: Cannot instantiate resource view {name} without a resource.
fi: Resurssinäkymää {name} ei voida luoda ilman resurssia.

source: Cannot instantiate resource view {name} without an associated flask extension.
fi: Resurssinäkymää {name} ei voida luoda ilman siihen liitettyä Flask-laajennusta.

source: Cannot instantiate administration view {name} without a default GET view
fi: Ylläpitonäkymää {name} ei voida luoda ilman oletusarvoista GET-näkymää

source: Unrecognized field type: %(field_type)s
fi: Tunnistamaton kenttätyyppi: %(field_type)s

source: Unrecognised schema field %(field)s: %(field_type_name)s
fi: Tunnistamaton skeemakenttä %(field)s: %(field_type_name)s

source: %(icon)s Administration
fi: %(icon)s Ylläpito

source: Item should be MenuItem instance.
fi: Kohteen on oltava MenuItem-olio.

source: Side menu
fi: Sivupalkki

source: Welcome to InvenioRDM Administration
fi: Tervetuloa InvenioRDM-ylläpitoon

source: Welcome to Invenio Administration
fi: Tervetuloa Invenio-ylläpitoon

source: My managment tool
fi: Hallintatyökaluni

source: Back
fi: Takaisin

source: Create
fi: Luo

source: Home navigation
fi: Etusivun navigointi

source: Back to front page
fi: Takaisin etusivulle

source: Menu
fi: Valikko

source: Close menu
fi: Sulje valikko

source: Administration dashboard
fi: Ylläpitonäkymä

source: Dashboard
fi: Ylläpito

source: Log in
fi: Kirjaudu sisään

source: Sign up
fi: Luo tili

source: My account
fi: Tilini

source: Log out
fi: Kirjaudu ulos

source: Toggle side menu
fi: Avaa/sulje sivuvalikko

source: Resource details
fi: Resurssin tiedot

source: Edit resource
fi: Muokkaa resurssia

source: Create resource
fi: Luo resurssi
